lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
/*
 ======================================================================
 GRAVEDIG RC TANK CONTROLLER
 Firmware 0.4

 ESP32-WROOM-32 / ESP32-WROOM-32E
 Cytron MDD3A
 PS5 DualSense via Bluepad32
 WS2811 / WS2812 status & lighting
 Wi-Fi SoftAP configuration
 Vehicle battery monitoring

 ----------------------------------------------------------------------
 PIN ASSIGNMENTS
 ----------------------------------------------------------------------

 GPIO 17  -> MDD3A M1A
 GPIO 18  -> MDD3A M1B

 GPIO 22  -> MDD3A M2A
 GPIO 23  -> MDD3A M2B

 GPIO 25  -> WS2811 / WS2812 data
             Pixel 0 reserved for SYSTEM STATUS

 GPIO 26  -> Reserved future Servo 1
 GPIO 27  -> Reserved future Servo 2

 GPIO 34  -> Vehicle battery ADC

 GPIO 0   -> Emergency abort button on development board

 ----------------------------------------------------------------------
 PS5 CONTROLS
 ----------------------------------------------------------------------

 LEFT STICK Y    Left track
 RIGHT STICK Y   Right track

 OPTIONS         Arm / Disarm

 L1              Low-speed profile
 R1              Normal-speed profile

 OPTIONS +
 TRIANGLE
 held 3 seconds  Toggle configuration Wi-Fi

 ----------------------------------------------------------------------
 WI-FI
 ----------------------------------------------------------------------

 SSID:       GraveDig
 Password:   GraveDig32
 Address:    http://192.168.4.1

 ----------------------------------------------------------------------
 STATUS COLORS
 ----------------------------------------------------------------------

 Blue pulse      Waiting for PS5 controller
 Blue            Connected / SAFE
 Green           Motors ARMED
 Yellow          Configuration Wi-Fi
 Flash yellow    Wi-Fi activation hold in progress
 Orange          LOW vehicle battery
 Red             CRITICAL vehicle battery
 Flash red       Emergency abort

 Battery status overrides normal operating colors.

 ======================================================================
*/

#include <Arduino.h>
#include <Bluepad32.h>

#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>

#include <Adafruit_NeoPixel.h>

#include <esp_arduino_version.h>

#include <math.h>


// ======================================================================
// VERSION
// ======================================================================

#define FIRMWARE_VERSION "0.4"


// ======================================================================
// HARDWARE
// ======================================================================

// MDD3A
#define M1A_PIN 17
#define M1B_PIN 18
#define M2A_PIN 22
#define M2B_PIN 23

// WS281x
#define PIXEL_PIN 25
#define PIXEL_COUNT 8

Adafruit_NeoPixel pixels(
    PIXEL_COUNT,
    PIXEL_PIN,
    NEO_GRB + NEO_KHZ800
);

// Vehicle battery
#define BATTERY_ADC_PIN 34

// Divider:
//
// Battery + -> 150K -> ADC -> 33K -> Ground
//
const float BAT_R_TOP = 150000.0;
const float BAT_R_BOTTOM = 33000.0;

const float BAT_DIVIDER_RATIO =
    (BAT_R_TOP + BAT_R_BOTTOM) /
    BAT_R_BOTTOM;

// Emergency button
#define ABORT_BUTTON 0


// ======================================================================
// MOTOR PWM
// ======================================================================

#define PWM_FREQ 10000
#define PWM_RESOLUTION 8
#define PWM_FULL 255

// ESP32 Arduino 2.x channels
#define PWM_CH_M1A 0
#define PWM_CH_M1B 1
#define PWM_CH_M2A 2
#define PWM_CH_M2B 3


// ======================================================================
// WI-FI
// ======================================================================

const char* AP_SSID =
    "GraveDig";

const char* AP_PASSWORD =
    "GraveDig32";

WebServer server(80);

bool wifiConfigActive = false;
bool wifiShutdownRequested = false;

unsigned long wifiLastActivity = 0;
unsigned long wifiShutdownRequestTime = 0;


// ======================================================================
// SETTINGS
// ======================================================================

Preferences prefs;


struct TankSettings {

    // Drive
    int lowSpeedPercent;
    int normalSpeedPercent;

    int stickDeadzone;

    int accelerationMs;
    int decelerationMs;

    int leftTrimPercent;
    int rightTrimPercent;

    bool invertLeft;
    bool invertRight;

    // 0 Linear
    // 1 Soft
    // 2 Medium
    // 3 Aggressive
    int responseCurve;


    // Lighting
    int pixelBrightness;


    // Wi-Fi
    int wifiTimeoutSeconds;

    // 0 = configuration mode can be started anytime
    int wifiAccessWindowSeconds;

    int wifiHoldSeconds;


    // Battery
    bool batteryEnabled;

    float lowBatteryVoltage;
    float criticalBatteryVoltage;
    float batteryHysteresis;

    float batteryCalibration;

    int batteryConfirmSeconds;

    bool batteryPixelWarning;
    bool batteryControllerLight;
    bool batteryRumble;


    // Critical behavior:
    //
    // 0 = warning only
    // 1 = reduce motor power
    // 2 = disable drive
    //
    int criticalBehavior;

    int criticalPowerLimitPercent;
};


TankSettings settings;


// ======================================================================
// CONTROLLER
// ======================================================================

ControllerPtr controller = nullptr;

bool motorsArmed = false;
bool emergencyAbort = false;


// ======================================================================
// BUTTON EDGE / HOLD STATE
// ======================================================================

bool previousOptions = false;
bool previousL1 = false;
bool previousR1 = false;

bool wifiComboActive = false;
bool wifiComboTriggered = false;

unsigned long wifiComboStart = 0;


// ======================================================================
// SPEED PROFILE
// ======================================================================

bool lowSpeedProfile = false;


// ======================================================================
// MOTOR STATE
// ======================================================================

