lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
int requestedLeftMotor = 0;
int requestedRightMotor = 0;

float appliedLeftMotor = 0;
float appliedRightMotor = 0;

int leftMotorCommand = 0;
int rightMotorCommand = 0;

unsigned long lastRampUpdate = 0;


// ======================================================================
// BATTERY STATE
// ======================================================================

enum BatteryState {
    BATTERY_UNKNOWN,
    BATTERY_NORMAL,
    BATTERY_LOW,
    BATTERY_CRITICAL
};


BatteryState batteryState =
    BATTERY_UNKNOWN;

BatteryState batteryCandidate =
    BATTERY_UNKNOWN;

unsigned long batteryCandidateSince = 0;

float batteryVoltage = 0.0;
float batteryFilteredVoltage = 0.0;

bool batteryFilterInitialized = false;

unsigned long lastBatterySample = 0;

unsigned long lastBatteryReminder = 0;


// ======================================================================
// RUMBLE SCHEDULER
// ======================================================================

struct RumblePattern {
    bool active;
    int pulsesRemaining;

    uint16_t durationMs;
    uint16_t gapMs;

    uint8_t weak;
    uint8_t strong;

    unsigned long nextPulse;
};


RumblePattern rumblePattern;


// ======================================================================
// STATUS COLORS
// ======================================================================

struct RGBColor {
    uint8_t r;
    uint8_t g;
    uint8_t b;
};


uint32_t lastPixelColor =
    0xFFFFFFFF;

uint32_t lastControllerColor =
    0xFFFFFFFF;


// ======================================================================
// TIMERS
// ======================================================================

unsigned long lastStatusUpdate = 0;
unsigned long lastSerialTelemetry = 0;


// ======================================================================
// FORWARD DECLARATIONS
// ======================================================================

void stopMotorsImmediate();
void updateStatusIndicators();


// ======================================================================
// DEFAULT SETTINGS
// ======================================================================

void setFactoryDefaults() {

    settings.lowSpeedPercent =
        30;

    settings.normalSpeedPercent =
        50;

    settings.stickDeadzone =
        55;

    settings.accelerationMs =
        800;

    settings.decelerationMs =
        500;

    settings.leftTrimPercent =
        100;

    settings.rightTrimPercent =
        100;

    settings.invertLeft =
        false;

    settings.invertRight =
        false;

    settings.responseCurve =
        2;


    settings.pixelBrightness =
        80;


    settings.wifiTimeoutSeconds =
        300;

    // Default:
    // Wi-Fi may only be STARTED during
    // first 60 seconds after boot.
    //
    // 0 = anytime.
    settings.wifiAccessWindowSeconds =
        60;

    settings.wifiHoldSeconds =
        3;


    // Disabled until voltage divider is installed.
    settings.batteryEnabled =
        false;

    settings.lowBatteryVoltage =
        7.20;

    settings.criticalBatteryVoltage =
        6.80;

    settings.batteryHysteresis =
        0.15;

    settings.batteryCalibration =
        1.000;

    settings.batteryConfirmSeconds =
        3;

    settings.batteryPixelWarning =
        true;

    settings.batteryControllerLight =
        true;

    settings.batteryRumble =
        true;

    settings.criticalBehavior =
        0;

    settings.criticalPowerLimitPercent =
        30;
}


// ======================================================================
// LOAD SETTINGS
// ======================================================================

void loadSettings() {

    setFactoryDefaults();

    prefs.begin(
        "gravedig",
        true
    );


    settings.lowSpeedPercent =
        prefs.getInt(
            "lowPct",
            settings.lowSpeedPercent
        );

    settings.normalSpeedPercent =
        prefs.getInt(
            "normPct",
            settings.normalSpeedPercent
        );

    settings.stickDeadzone =
        prefs.getInt(
            "deadzone",
            settings.stickDeadzone
        );

    settings.accelerationMs =
        prefs.getInt(
            "accel",
            settings.accelerationMs
        );

    settings.decelerationMs =
        prefs.getInt(
            "decel",
            settings.decelerationMs
        );

    settings.leftTrimPercent =
        prefs.getInt(
            "trimL",
            settings.leftTrimPercent
        );

    settings.rightTrimPercent =
        prefs.getInt(
            "trimR",
            settings.rightTrimPercent
        );

    settings.invertLeft =
        prefs.getBool(
            "invL",
            settings.invertLeft
        );

    settings.invertRight =
        prefs.getBool(
            "invR",
            settings.invertRight
        );

    settings.responseCurve =
        prefs.getInt(
            "curve",
            settings.responseCurve
        );


    settings.pixelBrightness =
        prefs.getInt(
            "pixBright",
            settings.pixelBrightness
        );


    settings.wifiTimeoutSeconds =
        prefs.getInt(
            "wifiTout",
            settings.wifiTimeoutSeconds
        );

    settings.wifiAccessWindowSeconds =
        prefs.getInt(
            "wifiWin",
            settings.wifiAccessWindowSeconds
        );

    settings.wifiHoldSeconds =
        prefs.getInt(
            "wifiHold",
            settings.wifiHoldSeconds
        );


    settings.batteryEnabled =
        prefs.getBool(
            "batEnable",
            settings.batteryEnabled
        );

    settings.lowBatteryVoltage =
        prefs.getFloat(
            "batLow",
            settings.lowBatteryVoltage
        );

    settings.criticalBatteryVoltage =
        prefs.getFloat(
            "batCrit",
            settings.criticalBatteryVoltage
        );

    settings.batteryHysteresis =
        prefs.getFloat(
            "batHyst",
            settings.batteryHysteresis
        );

    settings.batteryCalibration =
        prefs.getFloat(
            "batCal",
            settings.batteryCalibration
        );

