lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
    settings.batteryConfirmSeconds =
        prefs.getInt(
            "batDelay",
            settings.batteryConfirmSeconds
        );

    settings.batteryPixelWarning =
        prefs.getBool(
            "batPixel",
            settings.batteryPixelWarning
        );

    settings.batteryControllerLight =
        prefs.getBool(
            "batLight",
            settings.batteryControllerLight
        );

    settings.batteryRumble =
        prefs.getBool(
            "batRumble",
            settings.batteryRumble
        );

    settings.criticalBehavior =
        prefs.getInt(
            "critAct",
            settings.criticalBehavior
        );

    settings.criticalPowerLimitPercent =
        prefs.getInt(
            "critLimit",
            settings.criticalPowerLimitPercent
        );


    prefs.end();


    // Safety validation

    settings.lowSpeedPercent =
        constrain(
            settings.lowSpeedPercent,
            5,
            100
        );

    settings.normalSpeedPercent =
        constrain(
            settings.normalSpeedPercent,
            5,
            100
        );

    settings.stickDeadzone =
        constrain(
            settings.stickDeadzone,
            0,
            200
        );

    settings.accelerationMs =
        constrain(
            settings.accelerationMs,
            0,
            5000
        );

    settings.decelerationMs =
        constrain(
            settings.decelerationMs,
            0,
            5000
        );

    settings.leftTrimPercent =
        constrain(
            settings.leftTrimPercent,
            50,
            120
        );

    settings.rightTrimPercent =
        constrain(
            settings.rightTrimPercent,
            50,
            120
        );

    settings.responseCurve =
        constrain(
            settings.responseCurve,
            0,
            3
        );

    settings.pixelBrightness =
        constrain(
            settings.pixelBrightness,
            1,
            255
        );

    settings.wifiTimeoutSeconds =
        constrain(
            settings.wifiTimeoutSeconds,
            30,
            3600
        );

    settings.wifiAccessWindowSeconds =
        constrain(
            settings.wifiAccessWindowSeconds,
            0,
            3600
        );

    settings.wifiHoldSeconds =
        constrain(
            settings.wifiHoldSeconds,
            2,
            10
        );

    settings.batteryConfirmSeconds =
        constrain(
            settings.batteryConfirmSeconds,
            1,
            15
        );

    settings.criticalBehavior =
        constrain(
            settings.criticalBehavior,
            0,
            2
        );

    settings.criticalPowerLimitPercent =
        constrain(
            settings.criticalPowerLimitPercent,
            10,
            100
        );
}


// ======================================================================
// SAVE SETTINGS
// ======================================================================

void saveSettings() {

    prefs.begin(
        "gravedig",
        false
    );


    prefs.putInt(
        "lowPct",
        settings.lowSpeedPercent
    );

    prefs.putInt(
        "normPct",
        settings.normalSpeedPercent
    );

    prefs.putInt(
        "deadzone",
        settings.stickDeadzone
    );

    prefs.putInt(
        "accel",
        settings.accelerationMs
    );

    prefs.putInt(
        "decel",
        settings.decelerationMs
    );

    prefs.putInt(
        "trimL",
        settings.leftTrimPercent
    );

    prefs.putInt(
        "trimR",
        settings.rightTrimPercent
    );

    prefs.putBool(
        "invL",
        settings.invertLeft
    );

    prefs.putBool(
        "invR",
        settings.invertRight
    );

    prefs.putInt(
        "curve",
        settings.responseCurve
    );


    prefs.putInt(
        "pixBright",
        settings.pixelBrightness
    );


    prefs.putInt(
        "wifiTout",
        settings.wifiTimeoutSeconds
    );

    prefs.putInt(
        "wifiWin",
        settings.wifiAccessWindowSeconds
    );

    prefs.putInt(
        "wifiHold",
        settings.wifiHoldSeconds
    );


    prefs.putBool(
        "batEnable",
        settings.batteryEnabled
    );

    prefs.putFloat(
        "batLow",
        settings.lowBatteryVoltage
    );

    prefs.putFloat(
        "batCrit",
        settings.criticalBatteryVoltage
    );

    prefs.putFloat(
        "batHyst",
        settings.batteryHysteresis
    );

    prefs.putFloat(
        "batCal",
        settings.batteryCalibration
    );

    prefs.putInt(
        "batDelay",
        settings.batteryConfirmSeconds
    );

    prefs.putBool(
        "batPixel",
        settings.batteryPixelWarning
    );

    prefs.putBool(
        "batLight",
        settings.batteryControllerLight
    );

    prefs.putBool(
        "batRumble",
        settings.batteryRumble
    );

    prefs.putInt(
        "critAct",
        settings.criticalBehavior
    );

    prefs.putInt(
        "critLimit",
        settings.criticalPowerLimitPercent
    );


    prefs.end();


    pixels.setBrightness(
        settings.pixelBrightness
    );

    pixels.show();


    Serial.println(
        "Settings saved."
    );
}


// ======================================================================
// PWM INITIALIZATION
// ======================================================================

void setupPWM() {

#if ESP_ARDUINO_VERSION_MAJOR >= 3

    ledcAttach(
        M1A_PIN,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcAttach(
        M1B_PIN,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcAttach(
        M2A_PIN,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcAttach(
        M2B_PIN,
        PWM_FREQ,
        PWM_RESOLUTION
    );

#else

    ledcSetup(
        PWM_CH_M1A,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcSetup(
        PWM_CH_M1B,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcSetup(
        PWM_CH_M2A,
        PWM_FREQ,
        PWM_RESOLUTION
    );

    ledcSetup(
        PWM_CH_M2B,
        PWM_FREQ,
        PWM_RESOLUTION
    );


    ledcAttachPin(
        M1A_PIN,
        PWM_CH_M1A
    );

    ledcAttachPin(
        M1B_PIN,
        PWM_CH_M1B
    );

    ledcAttachPin(
        M2A_PIN,
        PWM_CH_M2A
    );

    ledcAttachPin(
        M2B_PIN,
        PWM_CH_M2B
    );

#endif
}


