lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
// ======================================================================
// PWM WRITE
// ======================================================================

void writePWM(
    uint8_t pin,
    uint8_t channel,
    int value
) {

    value =
        constrain(
            value,
            0,
            255
        );


#if ESP_ARDUINO_VERSION_MAJOR >= 3

    ledcWrite(
        pin,
        value
    );

#else

    ledcWrite(
        channel,
        value
    );

#endif
}


// ======================================================================
// MOTOR OUTPUT
// ======================================================================

void setMotor1(int speed) {

    speed =
        constrain(
            speed,
            -255,
            255
        );


    if (speed > 0) {

        writePWM(
            M1A_PIN,
            PWM_CH_M1A,
            speed
        );

        writePWM(
            M1B_PIN,
            PWM_CH_M1B,
            0
        );

    } else if (speed < 0) {

        writePWM(
            M1A_PIN,
            PWM_CH_M1A,
            0
        );

        writePWM(
            M1B_PIN,
            PWM_CH_M1B,
            -speed
        );

    } else {

        writePWM(
            M1A_PIN,
            PWM_CH_M1A,
            0
        );

        writePWM(
            M1B_PIN,
            PWM_CH_M1B,
            0
        );
    }
}


void setMotor2(int speed) {

    speed =
        constrain(
            speed,
            -255,
            255
        );


    if (speed > 0) {

        writePWM(
            M2A_PIN,
            PWM_CH_M2A,
            speed
        );

        writePWM(
            M2B_PIN,
            PWM_CH_M2B,
            0
        );

    } else if (speed < 0) {

        writePWM(
            M2A_PIN,
            PWM_CH_M2A,
            0
        );

        writePWM(
            M2B_PIN,
            PWM_CH_M2B,
            -speed
        );

    } else {

        writePWM(
            M2A_PIN,
            PWM_CH_M2A,
            0
        );

        writePWM(
            M2B_PIN,
            PWM_CH_M2B,
            0
        );
    }
}


// ======================================================================
// IMMEDIATE SAFETY STOP
// ======================================================================

void stopMotorsImmediate() {

    requestedLeftMotor = 0;
    requestedRightMotor = 0;

    appliedLeftMotor = 0;
    appliedRightMotor = 0;

    leftMotorCommand = 0;
    rightMotorCommand = 0;

    setMotor1(0);
    setMotor2(0);
}


// ======================================================================
// CURRENT SPEED LIMIT
// ======================================================================

int selectedSpeedPercent() {

    return lowSpeedProfile
        ? settings.lowSpeedPercent
        : settings.normalSpeedPercent;
}


int effectiveSpeedPercent() {

    int percent =
        selectedSpeedPercent();


    if (
        settings.batteryEnabled &&
        batteryState ==
            BATTERY_CRITICAL &&
        settings.criticalBehavior == 1
    ) {

        percent =
            min(
                percent,
                settings.criticalPowerLimitPercent
            );
    }


    return percent;
}


// ======================================================================
// RESPONSE CURVE
// ======================================================================

float applyResponseCurve(
    float value
) {

    value =
        constrain(
            value,
            0.0f,
            1.0f
        );


    switch (
        settings.responseCurve
    ) {

        // Linear
        case 0:
            return value;

        // Soft
        case 1:
            return powf(
                value,
                1.8f
            );

        // Medium
        case 2:
            return powf(
                value,
                1.4f
            );

        // Aggressive
        case 3:
            return powf(
                value,
                0.70f
            );
    }


    return value;
}


// ======================================================================
// STICK -> MOTOR COMMAND
// ======================================================================

int stickToMotor(
    int rawValue
) {

    const int stickMax =
        512;


    rawValue =
        constrain(
            rawValue,
            -stickMax,
            stickMax
        );


    int magnitude =
        abs(rawValue);


    if (
        magnitude <=
        settings.stickDeadzone
    ) {
        return 0;
    }


    float normalized =
        (
            float(
                magnitude -
                settings.stickDeadzone
            )
        ) /
        (
            float(
                stickMax -
                settings.stickDeadzone
            )
        );


    normalized =
        constrain(
            normalized,
            0.0f,
            1.0f
        );


    normalized =
        applyResponseCurve(
            normalized
        );


    int maxPWM =
        round(
            effectiveSpeedPercent() *
            2.55f
        );


    int result =
        round(
            normalized *
            maxPWM
        );


    if (rawValue < 0) {
        result =
            -result;
    }


    return result;
}


// ======================================================================
// MOTOR RAMPING
// ======================================================================

float rampToward(
    float current,
    float target,
    unsigned long dt
) {

    // Never instantly reverse polarity.
    // Ramp to zero first.

    if (
        current > 0 &&
        target < 0
    ) {
        target = 0;
    }

    if (
        current < 0 &&
        target > 0
    ) {
        target = 0;
    }


    bool accelerating =
        abs(target) >
        abs(current);


    int rampTime =
        accelerating
            ? settings.accelerationMs
            : settings.decelerationMs;


    if (rampTime <= 0) {
        return target;
    }


    float step =
        255.0f *
        (
            float(dt) /
            float(rampTime)
        );


    if (step < 0.25f) {
        step = 0.25f;
    }


