lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
    if (current < target) {

        current += step;

        if (current > target) {
            current = target;
        }

    } else if (current > target) {

        current -= step;

        if (current < target) {
            current = target;
        }
    }


    return current;
}


// ======================================================================
// APPLY MOTOR RAMP
// ======================================================================

void serviceMotorRamp() {

    unsigned long now =
        millis();


    unsigned long dt =
        now -
        lastRampUpdate;


    if (dt < 10) {
        return;
    }


    lastRampUpdate =
        now;


    // Avoid giant step after debugging pause.
    if (dt > 50) {
        dt = 50;
    }


    bool driveAllowed =
        controller &&
        controller->isConnected() &&
        motorsArmed &&
        !emergencyAbort &&
        !wifiConfigActive;


    if (
        settings.batteryEnabled &&
        batteryState ==
            BATTERY_CRITICAL &&
        settings.criticalBehavior == 2
    ) {
        driveAllowed = false;
    }


    if (!driveAllowed) {

        stopMotorsImmediate();

        return;
    }


    appliedLeftMotor =
        rampToward(
            appliedLeftMotor,
            requestedLeftMotor,
            dt
        );


    appliedRightMotor =
        rampToward(
            appliedRightMotor,
            requestedRightMotor,
            dt
        );


    leftMotorCommand =
        round(
            appliedLeftMotor
        );

    rightMotorCommand =
        round(
            appliedRightMotor
        );


    setMotor1(
        leftMotorCommand
    );

    setMotor2(
        rightMotorCommand
    );
}


// ======================================================================
// DRIVE PROCESSING
// ======================================================================

void processDrive() {

    if (
        !controller ||
        !controller->isConnected() ||
        !motorsArmed ||
        emergencyAbort ||
        wifiConfigActive
    ) {

        requestedLeftMotor = 0;
        requestedRightMotor = 0;

        return;
    }


    int leftRaw =
        -controller->axisY();

    int rightRaw =
        -controller->axisRY();


    int left =
        stickToMotor(
            leftRaw
        );

    int right =
        stickToMotor(
            rightRaw
        );


    // Motor trim

    left =
        round(
            left *
            settings.leftTrimPercent /
            100.0f
        );

    right =
        round(
            right *
            settings.rightTrimPercent /
            100.0f
        );


    left =
        constrain(
            left,
            -255,
            255
        );

    right =
        constrain(
            right,
            -255,
            255
        );


    // Software reversal

    if (
        settings.invertLeft
    ) {
        left =
            -left;
    }


    if (
        settings.invertRight
    ) {
        right =
            -right;
    }


    requestedLeftMotor =
        left;

    requestedRightMotor =
        right;
}


// ======================================================================
// RUMBLE
// ======================================================================

void queueRumble(
    int pulses,
    uint16_t durationMs,
    uint16_t gapMs,
    uint8_t weak,
    uint8_t strong
) {

    if (
        !controller ||
        !controller->isConnected()
    ) {
        return;
    }


    rumblePattern.active =
        true;

    rumblePattern.pulsesRemaining =
        pulses;

    rumblePattern.durationMs =
        durationMs;

    rumblePattern.gapMs =
        gapMs;

    rumblePattern.weak =
        weak;

    rumblePattern.strong =
        strong;

    rumblePattern.nextPulse =
        millis();
}


void serviceRumble() {

    if (
        !rumblePattern.active ||
        !controller ||
        !controller->isConnected()
    ) {
        return;
    }


    unsigned long now =
        millis();


    if (
        now <
        rumblePattern.nextPulse
    ) {
        return;
    }


    controller->playDualRumble(
        0,
        rumblePattern.durationMs,
        rumblePattern.weak,
        rumblePattern.strong
    );


    rumblePattern.pulsesRemaining--;


    if (
        rumblePattern.pulsesRemaining <=
        0
    ) {

        rumblePattern.active =
            false;

    } else {

        rumblePattern.nextPulse =
            now +
            rumblePattern.durationMs +
            rumblePattern.gapMs;
    }
}


// ======================================================================
// BATTERY STATE NAME
// ======================================================================

const char* batteryStateName(
    BatteryState state
) {

    switch (state) {

        case BATTERY_NORMAL:
            return "NORMAL";

        case BATTERY_LOW:
            return "LOW";

        case BATTERY_CRITICAL:
            return "CRITICAL";

        default:
            return "UNKNOWN";
    }
}


// ======================================================================
// DETERMINE BATTERY STATE WITH HYSTERESIS
// ======================================================================

BatteryState determineBatteryState(
    float voltage
) {

    if (
        batteryState ==
        BATTERY_CRITICAL
    ) {

        if (
            voltage >=
            settings.lowBatteryVoltage +
            settings.batteryHysteresis
        ) {
            return BATTERY_NORMAL;
        }

        if (
            voltage >=
            settings.criticalBatteryVoltage +
            settings.batteryHysteresis
        ) {
            return BATTERY_LOW;
        }

        return BATTERY_CRITICAL;
    }


    if (
        batteryState ==
        BATTERY_LOW
    ) {

        if (
            voltage <=
            settings.criticalBatteryVoltage
        ) {
            return BATTERY_CRITICAL;
        }

        if (
            voltage >=
            settings.lowBatteryVoltage +
            settings.batteryHysteresis
        ) {
            return BATTERY_NORMAL;
        }

