lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
        return BATTERY_LOW;
    }


    if (
        voltage <=
        settings.criticalBatteryVoltage
    ) {
        return BATTERY_CRITICAL;
    }


    if (
        voltage <=
        settings.lowBatteryVoltage
    ) {
        return BATTERY_LOW;
    }


    return BATTERY_NORMAL;
}


// ======================================================================
// BATTERY STATE CHANGE
// ======================================================================

void batteryStateChanged(
    BatteryState newState
) {

    batteryState =
        newState;


    Serial.print(
        "Battery state: "
    );

    Serial.println(
        batteryStateName(
            newState
        )
    );


    if (
        newState ==
        BATTERY_LOW
    ) {

        if (
            settings.batteryRumble
        ) {

            queueRumble(
                2,
                180,
                150,
                90,
                60
            );
        }


        lastBatteryReminder =
            millis();
    }


    if (
        newState ==
        BATTERY_CRITICAL
    ) {

        if (
            settings.criticalBehavior ==
            2
        ) {

            motorsArmed =
                false;

            stopMotorsImmediate();
        }


        if (
            settings.batteryRumble
        ) {

            queueRumble(
                3,
                230,
                120,
                180,
                150
            );
        }


        lastBatteryReminder =
            millis();
    }
}


// ======================================================================
// BATTERY MONITOR
// ======================================================================

void serviceBatteryMonitor() {

    if (
        !settings.batteryEnabled
    ) {

        batteryState =
            BATTERY_UNKNOWN;

        batteryFilterInitialized =
            false;

        return;
    }


    unsigned long now =
        millis();


    if (
        now -
        lastBatterySample <
        100
    ) {
        return;
    }


    lastBatterySample =
        now;


    uint32_t totalMillivolts =
        0;


    const int samples =
        12;


    for (
        int i = 0;
        i < samples;
        i++
    ) {

        totalMillivolts +=
            analogReadMilliVolts(
                BATTERY_ADC_PIN
            );
    }


    float adcVolts =
        (
            totalMillivolts /
            float(samples)
        ) /
        1000.0f;


    float measured =
        adcVolts *
        BAT_DIVIDER_RATIO *
        settings.batteryCalibration;


    // Treat very low voltage as "not connected".
    if (measured < 0.50f) {

        batteryState =
            BATTERY_UNKNOWN;

        batteryFilterInitialized =
            false;

        return;
    }


    batteryVoltage =
        measured;


    // Exponential filtering
    if (
        !batteryFilterInitialized
    ) {

        batteryFilteredVoltage =
            measured;

        batteryFilterInitialized =
            true;

    } else {

        const float alpha =
            0.15f;

        batteryFilteredVoltage =
            batteryFilteredVoltage +
            alpha *
            (
                measured -
                batteryFilteredVoltage
            );
    }


    BatteryState desired =
        determineBatteryState(
            batteryFilteredVoltage
        );


    // Initialize immediately
    if (
        batteryState ==
        BATTERY_UNKNOWN
    ) {

        batteryState =
            desired;

        batteryCandidate =
            desired;

        batteryCandidateSince =
            now;

        return;
    }


    if (
        desired ==
        batteryState
    ) {

        batteryCandidate =
            desired;

        batteryCandidateSince =
            now;

    } else {

        if (
            desired !=
            batteryCandidate
        ) {

            batteryCandidate =
                desired;

            batteryCandidateSince =
                now;
        }


        unsigned long confirmMs =
            settings.batteryConfirmSeconds *
            1000UL;


        if (
            now -
            batteryCandidateSince >=
            confirmMs
        ) {

            batteryStateChanged(
                desired
            );
        }
    }


    // Periodic reminder rumble

    if (
        settings.batteryRumble &&
        controller &&
        controller->isConnected()
    ) {

        if (
            batteryState ==
            BATTERY_LOW &&
            now -
            lastBatteryReminder >
            60000UL
        ) {

            queueRumble(
                2,
                180,
                150,
                90,
                60
            );

            lastBatteryReminder =
                now;
        }


        if (
            batteryState ==
            BATTERY_CRITICAL &&
            now -
            lastBatteryReminder >
            15000UL
        ) {

            queueRumble(
                3,
                230,
                120,
                180,
                150
            );

            lastBatteryReminder =
                now;
        }
    }
}


// ======================================================================
// STATUS COLOR
// ======================================================================

RGBColor getStatusColor(
    bool allowBatteryWarning
) {

    RGBColor color;


    // Emergency
    if (emergencyAbort) {

        bool on =
            (
                millis() /
                200
            ) %
            2;

        color.r =
            on ? 255 : 0;

        color.g = 0;
        color.b = 0;

        return color;
    }


    // Battery warnings

    if (
        allowBatteryWarning &&
        settings.batteryEnabled
    ) {

        if (
            batteryState ==
            BATTERY_CRITICAL
        ) {

            color.r = 255;
            color.g = 0;
            color.b = 0;

