lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
            return color;
        }


        if (
            batteryState ==
            BATTERY_LOW
        ) {

            color.r = 255;
            color.g = 75;
            color.b = 0;

            return color;
        }
    }


    // Wi-Fi combo hold

    if (
        wifiComboActive &&
        !wifiComboTriggered
    ) {

        bool on =
            (
                millis() /
                180
            ) %
            2;

        color.r =
            on ? 255 : 30;

        color.g =
            on ? 140 : 10;

        color.b = 0;

        return color;
    }


    // Wi-Fi active

    if (
        wifiConfigActive
    ) {

        color.r = 255;
        color.g = 150;
        color.b = 0;

        return color;
    }


    // Waiting for controller

    if (
        !controller ||
        !controller->isConnected()
    ) {

        int phase =
            (
                millis() /
                15
            ) %
            200;

        if (phase > 100) {
            phase =
                200 -
                phase;
        }


        color.r = 0;
        color.g = 0;

        color.b =
            map(
                phase,
                0,
                100,
                5,
                150
            );

        return color;
    }


    // Armed

    if (
        motorsArmed
    ) {

        color.r = 0;
        color.g = 200;
        color.b = 0;

        return color;
    }


    // Safe

    color.r = 0;
    color.g = 0;
    color.b = 180;

    return color;
}


// ======================================================================
// STATUS INDICATORS
// ======================================================================

void updateStatusIndicators() {

    if (
        millis() -
        lastStatusUpdate <
        50
    ) {
        return;
    }


    lastStatusUpdate =
        millis();


    // Pixel status

    RGBColor pixelColor =
        getStatusColor(
            settings.batteryPixelWarning
        );


    uint32_t packedPixel =
        (
            uint32_t(pixelColor.r) <<
            16
        ) |
        (
            uint32_t(pixelColor.g) <<
            8
        ) |
        pixelColor.b;


    if (
        packedPixel !=
        lastPixelColor
    ) {

        pixels.setPixelColor(
            0,
            pixels.Color(
                pixelColor.r,
                pixelColor.g,
                pixelColor.b
            )
        );

        pixels.show();

        lastPixelColor =
            packedPixel;
    }


    // DualSense lightbar

    if (
        controller &&
        controller->isConnected()
    ) {

        RGBColor controllerColor =
            getStatusColor(
                settings.batteryControllerLight
            );


        uint32_t packedController =
            (
                uint32_t(
                    controllerColor.r
                ) <<
                16
            ) |
            (
                uint32_t(
                    controllerColor.g
                ) <<
                8
            ) |
            controllerColor.b;


        if (
            packedController !=
            lastControllerColor
        ) {

            controller->setColorLED(
                controllerColor.r,
                controllerColor.g,
                controllerColor.b
            );


            lastControllerColor =
                packedController;
        }
    }
}


// ======================================================================
// EMERGENCY STOP
// ======================================================================

void emergencyStop() {

    emergencyAbort =
        true;

    motorsArmed =
        false;

    stopMotorsImmediate();


    queueRumble(
        4,
        180,
        100,
        255,
        255
    );


    Serial.println();
    Serial.println(
        "*** EMERGENCY ABORT ***"
    );
}


// ======================================================================
// ABORT BUTTON
// ======================================================================

void checkAbortButton() {

    if (emergencyAbort) {
        return;
    }


    if (
        digitalRead(
            ABORT_BUTTON
        ) ==
        LOW
    ) {

        delay(20);


        if (
            digitalRead(
                ABORT_BUTTON
            ) ==
            LOW
        ) {

            emergencyStop();
        }
    }
}


// ======================================================================
// CONTROLLER BATTERY PERCENT
// ======================================================================

int controllerBatteryPercent() {

    if (
        !controller ||
        !controller->isConnected()
    ) {
        return -1;
    }


    int value =
        controller->battery();


    // Bluepad32:
    // 0 = unknown
    // 1 = empty
    // 255 = full

    if (value == 0) {
        return -1;
    }


    return constrain(
        map(
            value,
            1,
            255,
            0,
            100
        ),
        0,
        100
    );
}


// ======================================================================
// UPTIME STRING
// ======================================================================

String uptimeString() {

    unsigned long seconds =
        millis() /
        1000UL;


    unsigned long hours =
        seconds /
        3600UL;

    unsigned long minutes =
        (
            seconds %
            3600UL
        ) /
        60UL;

    seconds =
        seconds %
        60UL;


    char buffer[24];


    snprintf(
        buffer,
        sizeof(buffer),
        "%02lu:%02lu:%02lu",
        hours,
        minutes,
        seconds
    );


    return String(
        buffer
    );
}


// ======================================================================
// WEB ACTIVITY
// ======================================================================

void noteWebActivity() {

    wifiLastActivity =
        millis();
}


// ======================================================================
// WEB PAGE
// ======================================================================

