lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
String makeWebPage() {

    String html;

    html.reserve(12000);


    html += R"HTML(
<!DOCTYPE html>
<html>

<head>

<meta name="viewport"
content="width=device-width,initial-scale=1">

<title>GraveDig</title>

<style>

body {
    font-family: Arial, sans-serif;
    margin: 0;
    background: #101010;
    color: #eeeeee;
}

.container {
    max-width: 760px;
    margin: auto;
    padding: 18px;
}

.card {
    background: #222;
    border-radius: 10px;
    padding: 18px;
    margin-bottom: 16px;
}

h1 {
    margin-bottom: 4px;
}

h2 {
    margin-top: 0;
    font-size: 19px;
}

label {
    display: block;
    margin-top: 14px;
}

input,
select {
    width: 100%;
    padding: 9px;
    margin-top: 5px;
    box-sizing: border-box;
    background: #333;
    color: white;
    border: 1px solid #555;
    border-radius: 4px;
}

input[type=checkbox] {
    width: auto;
}

button {
    border: 0;
    border-radius: 6px;
    padding: 12px 18px;
    margin-top: 12px;
    font-size: 16px;
}

.save {
    background: #238636;
    color: white;
}

.warning {
    background: #9a6700;
    color: white;
}

.danger {
    background: #b62324;
    color: white;
}

.status {
    font-family: monospace;
    line-height: 1.65;
}

.small {
    font-size: 13px;
    opacity: .75;
}

.grid {
    display: grid;
    grid-template-columns: 1fr 1fr;
    gap: 12px;
}

@media(max-width:600px) {
    .grid {
        grid-template-columns: 1fr;
    }
}

</style>

</head>

<body>

<div class="container">

<h1>GraveDig</h1>
<div class="small">
Firmware )HTML";


    html +=
        FIRMWARE_VERSION;


    html += R"HTML(
</div>


<div class="card">

<h2>Live Status</h2>

<div
class="status"
id="status">
Loading...
</div>

</div>


<form method="POST"
action="/save">


<div class="card">

<h2>Drive</h2>


<div class="grid">

<label>
Low-speed limit (%)
<input
type="number"
name="lowSpeed"
min="5"
max="100"
value=")HTML";

    html +=
        String(
            settings.lowSpeedPercent
        );


    html += R"HTML(">
</label>


<label>
Normal-speed limit (%)
<input
type="number"
name="normalSpeed"
min="5"
max="100"
value=")HTML";

    html +=
        String(
            settings.normalSpeedPercent
        );


    html += R"HTML(">
</label>


<label>
Stick dead zone
<input
type="number"
name="deadzone"
min="0"
max="200"
value=")HTML";

    html +=
        String(
            settings.stickDeadzone
        );


    html += R"HTML(">
</label>


<label>
Response curve

<select name="curve">

<option value="0")HTML";

    if (
        settings.responseCurve ==
        0
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Linear
</option>

<option value="1")HTML";

    if (
        settings.responseCurve ==
        1
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Soft
</option>

<option value="2")HTML";

    if (
        settings.responseCurve ==
        2
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Medium
</option>

<option value="3")HTML";

    if (
        settings.responseCurve ==
        3
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Aggressive
</option>

</select>

</label>


<label>
Acceleration time (ms)
<input
type="number"
name="accel"
min="0"
max="5000"
value=")HTML";

    html +=
        String(
            settings.accelerationMs
        );


    html += R"HTML(">
</label>


<label>
Deceleration time (ms)
<input
type="number"
name="decel"
min="0"
max="5000"
value=")HTML";

    html +=
        String(
            settings.decelerationMs
        );


    html += R"HTML(">
</label>


<label>
Left motor trim (%)
<input
type="number"
name="trimL"
min="50"
max="120"
value=")HTML";

    html +=
        String(
            settings.leftTrimPercent
        );


    html += R"HTML(">
</label>


<label>
Right motor trim (%)
<input
type="number"
name="trimR"
min="50"
max="120"
value=")HTML";

    html +=
        String(
            settings.rightTrimPercent
        );


    html += R"HTML(">
</label>

</div>


<label>

<input
type="checkbox"
name="invertLeft")HTML";

    if (
        settings.invertLeft
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Reverse left motor

</label>


<label>

<input
type="checkbox"
name="invertRight")HTML";

    if (
        settings.invertRight
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Reverse right motor

</label>

</div>


<div class="card">

<h2>Lighting</h2>

<label>
Master pixel brightness
<input
type="number"
name="brightness"
min="1"
max="255"
value=")HTML";

    html +=
        String(
            settings.pixelBrightness
        );


    html += R"HTML(">
</label>

<p class="small">
Pixel 0 is reserved for system status.
Pixels 1 and above remain available for lighting effects.
</p>

</div>


<div class="card">

<h2>Battery Monitoring</h2>


<label>

<input
type="checkbox"
name="batteryEnabled")HTML";

    if (
        settings.batteryEnabled
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Enable vehicle battery monitoring

</label>


<div class="grid">


<label>
Low warning voltage
<input
type="number"
step="0.01"
name="lowV"
value=")HTML";

    html +=
        String(
            settings.lowBatteryVoltage,
            2
        );


    html += R"HTML(">
</label>


<label>
Critical voltage
<input
type="number"
step="0.01"
name="criticalV"
value=")HTML";

    html +=
        String(
            settings.criticalBatteryVoltage,
            2
        );


    html += R"HTML(">
</label>


<label>
Recovery hysteresis
<input
type="number"
step="0.01"
name="hysteresis"
value=")HTML";

    html +=
        String(
            settings.batteryHysteresis,
            2
        );


    html += R"HTML(">
</label>


<label>
ADC calibration multiplier
<input
type="number"
step="0.001"
name="batteryCal"
value=")HTML";

    html +=
        String(
            settings.batteryCalibration,
            3
        );


    html += R"HTML(">
</label>


<label>
Threshold confirmation time (sec)
<input
type="number"
min="1"
max="15"
name="batteryDelay"
value=")HTML";

