lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
    html +=
        String(
            settings.batteryConfirmSeconds
        );


    html += R"HTML(">
</label>


<label>
Critical power limit (%)
<input
type="number"
min="10"
max="100"
name="criticalLimit"
value=")HTML";

    html +=
        String(
            settings.criticalPowerLimitPercent
        );


    html += R"HTML(">
</label>

</div>


<label>
Critical battery action

<select name="criticalBehavior">

<option value="0")HTML";

    if (
        settings.criticalBehavior ==
        0
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Warn only
</option>

<option value="1")HTML";

    if (
        settings.criticalBehavior ==
        1
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Limit motor power
</option>

<option value="2")HTML";

    if (
        settings.criticalBehavior ==
        2
    ) {
        html +=
            " selected";
    }


    html += R"HTML(>
Disable drive
</option>

</select>

</label>


<label>

<input
type="checkbox"
name="batteryPixel")HTML";

    if (
        settings.batteryPixelWarning
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Battery warning on status pixel

</label>


<label>

<input
type="checkbox"
name="batteryLight")HTML";

    if (
        settings.batteryControllerLight
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Battery warning on DualSense lightbar

</label>


<label>

<input
type="checkbox"
name="batteryRumble")HTML";

    if (
        settings.batteryRumble
    ) {
        html +=
            " checked";
    }


    html += R"HTML(>

Battery warning using DualSense rumble

</label>


</div>


<div class="card">

<h2>Configuration Access</h2>


<div class="grid">


<label>
Wi-Fi idle timeout (sec)
<input
type="number"
name="wifiTimeout"
min="30"
max="3600"
value=")HTML";

    html +=
        String(
            settings.wifiTimeoutSeconds
        );


    html += R"HTML(">
</label>


<label>
Wi-Fi startup access window (sec)
<input
type="number"
name="wifiWindow"
min="0"
max="3600"
value=")HTML";

    html +=
        String(
            settings.wifiAccessWindowSeconds
        );


    html += R"HTML(">
</label>


<label>
OPTIONS + Triangle hold (sec)
<input
type="number"
name="wifiHold"
min="2"
max="10"
value=")HTML";

    html +=
        String(
            settings.wifiHoldSeconds
        );


    html += R"HTML(">
</label>


</div>


<p class="small">

Set startup access window to 0 to allow configuration mode
to be entered anytime while the vehicle is SAFE.

</p>

</div>


<div class="card">

<button
class="save"
type="submit">
Save Settings
</button>

</form>


<form
method="POST"
action="/defaults">

<button
class="warning"
type="submit">
Restore Factory Defaults
</button>

</form>


<form
method="POST"
action="/wifi-off">

<button
class="danger"
type="submit">
Shut Down Wi-Fi
</button>

</form>

</div>


</div>


<script>

function updateStatus() {

fetch('/status')

.then(
response =>
response.json()
)

.then(data => {

let s = '';

s +=
'Controller: ' +
data.controller +
'<br>';

s +=
'Controller Battery: ' +
data.controllerBattery +
'<br>';

s +=
'Drive: ' +
data.drive +
'<br>';

s +=
'Speed Profile: ' +
data.profile +
'<br>';

s +=
'Left Motor: ' +
data.left +
'%<br>';

s +=
'Right Motor: ' +
data.right +
'%<br>';

s +=
'Vehicle Battery: ' +
data.vehicleVoltage +
'<br>';

s +=
'Battery State: ' +
data.batteryState +
'<br>';

s +=
'Wi-Fi Clients: ' +
data.clients +
'<br>';

s +=
'Uptime: ' +
data.uptime +
'<br>';

document.getElementById(
'status'
).innerHTML = s;

})

.catch(
() => {}
);

}


updateStatus();

setInterval(
updateStatus,
2000
);

</script>

</body>

</html>
)HTML";


    return html;
}


// ======================================================================
// WEB STATUS JSON
// ======================================================================

void handleStatus() {

    noteWebActivity();


    String json =
        "{";


    json +=
        "\"controller\":\"";

    json +=
        (
            controller &&
            controller->isConnected()
        )
        ? "CONNECTED"
        : "WAITING";

    json +=
        "\",";


    int controllerBattery =
        controllerBatteryPercent();


    json +=
        "\"controllerBattery\":\"";

    if (
        controllerBattery < 0
    ) {

        json +=
            "Unknown";

    } else {

        json +=
            String(
                controllerBattery
            );

        json +=
            "%";
    }

    json +=
        "\",";


    json +=
        "\"drive\":\"";

    if (emergencyAbort) {

        json +=
            "ABORTED";

    } else if (
        motorsArmed
    ) {

        json +=
            "ARMED";

    } else {

        json +=
            "SAFE";
    }

    json +=
        "\",";


    json +=
        "\"profile\":\"";

    json +=
        lowSpeedProfile
            ? "LOW"
            : "NORMAL";

    json +=
        "\",";


    json +=
        "\"left\":" +
        String(
            leftMotorCommand *
            100 /
            255
        ) +
        ",";


    json +=
        "\"right\":" +
        String(
            rightMotorCommand *
            100 /
            255
        ) +
        ",";


    json +=
        "\"vehicleVoltage\":\"";

    if (
        !settings.batteryEnabled ||
        batteryState ==
            BATTERY_UNKNOWN
    ) {

        json +=
            "Disabled / Unknown";

    } else {

        json +=
            String(
                batteryFilteredVoltage,
                2
            );

        json +=
            " V";
    }

    json +=
        "\",";


    json +=
        "\"batteryState\":\"";

    json +=
        batteryStateName(
            batteryState
        );

    json +=
        "\",";


    json +=
        "\"clients\":" +
        String(
            WiFi.softAPgetStationNum()
        ) +
        ",";


    json +=
        "\"uptime\":\"" +
        uptimeString() +
        "\"";


    json +=
        "}";


    server.send(
        200,
        "application/json",
        json
    );
}


