lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
// ======================================================================
// WEB SAVE
// ======================================================================

void handleSave() {

    noteWebActivity();


    if (
        server.hasArg(
            "lowSpeed"
        )
    ) {

        settings.lowSpeedPercent =
            constrain(
                server.arg(
                    "lowSpeed"
                ).toInt(),
                5,
                100
            );
    }


    if (
        server.hasArg(
            "normalSpeed"
        )
    ) {

        settings.normalSpeedPercent =
            constrain(
                server.arg(
                    "normalSpeed"
                ).toInt(),
                5,
                100
            );
    }


    if (
        server.hasArg(
            "deadzone"
        )
    ) {

        settings.stickDeadzone =
            constrain(
                server.arg(
                    "deadzone"
                ).toInt(),
                0,
                200
            );
    }


    if (
        server.hasArg(
            "curve"
        )
    ) {

        settings.responseCurve =
            constrain(
                server.arg(
                    "curve"
                ).toInt(),
                0,
                3
            );
    }


    if (
        server.hasArg(
            "accel"
        )
    ) {

        settings.accelerationMs =
            constrain(
                server.arg(
                    "accel"
                ).toInt(),
                0,
                5000
            );
    }


    if (
        server.hasArg(
            "decel"
        )
    ) {

        settings.decelerationMs =
            constrain(
                server.arg(
                    "decel"
                ).toInt(),
                0,
                5000
            );
    }


    if (
        server.hasArg(
            "trimL"
        )
    ) {

        settings.leftTrimPercent =
            constrain(
                server.arg(
                    "trimL"
                ).toInt(),
                50,
                120
            );
    }


    if (
        server.hasArg(
            "trimR"
        )
    ) {

        settings.rightTrimPercent =
            constrain(
                server.arg(
                    "trimR"
                ).toInt(),
                50,
                120
            );
    }


    settings.invertLeft =
        server.hasArg(
            "invertLeft"
        );

    settings.invertRight =
        server.hasArg(
            "invertRight"
        );


    if (
        server.hasArg(
            "brightness"
        )
    ) {

        settings.pixelBrightness =
            constrain(
                server.arg(
                    "brightness"
                ).toInt(),
                1,
                255
            );
    }


    // Battery

    settings.batteryEnabled =
        server.hasArg(
            "batteryEnabled"
        );


    if (
        server.hasArg(
            "lowV"
        )
    ) {

        settings.lowBatteryVoltage =
            server.arg(
                "lowV"
            ).toFloat();
    }


    if (
        server.hasArg(
            "criticalV"
        )
    ) {

        settings.criticalBatteryVoltage =
            server.arg(
                "criticalV"
            ).toFloat();
    }


    if (
        server.hasArg(
            "hysteresis"
        )
    ) {

        settings.batteryHysteresis =
            server.arg(
                "hysteresis"
            ).toFloat();
    }


    if (
        server.hasArg(
            "batteryCal"
        )
    ) {

        settings.batteryCalibration =
            server.arg(
                "batteryCal"
            ).toFloat();
    }


    if (
        server.hasArg(
            "batteryDelay"
        )
    ) {

        settings.batteryConfirmSeconds =
            constrain(
                server.arg(
                    "batteryDelay"
                ).toInt(),
                1,
                15
            );
    }


    settings.batteryPixelWarning =
        server.hasArg(
            "batteryPixel"
        );

    settings.batteryControllerLight =
        server.hasArg(
            "batteryLight"
        );

    settings.batteryRumble =
        server.hasArg(
            "batteryRumble"
        );


    if (
        server.hasArg(
            "criticalBehavior"
        )
    ) {

        settings.criticalBehavior =
            constrain(
                server.arg(
                    "criticalBehavior"
                ).toInt(),
                0,
                2
            );
    }


    if (
        server.hasArg(
            "criticalLimit"
        )
    ) {

        settings.criticalPowerLimitPercent =
            constrain(
                server.arg(
                    "criticalLimit"
                ).toInt(),
                10,
                100
            );
    }


    // Wi-Fi

    if (
        server.hasArg(
            "wifiTimeout"
        )
    ) {

        settings.wifiTimeoutSeconds =
            constrain(
                server.arg(
                    "wifiTimeout"
                ).toInt(),
                30,
                3600
            );
    }


    if (
        server.hasArg(
            "wifiWindow"
        )
    ) {

        settings.wifiAccessWindowSeconds =
            constrain(
                server.arg(
                    "wifiWindow"
                ).toInt(),
                0,
                3600
            );
    }


    if (
        server.hasArg(
            "wifiHold"
        )
    ) {

        settings.wifiHoldSeconds =
            constrain(
                server.arg(
                    "wifiHold"
                ).toInt(),
                2,
                10
            );
    }


    saveSettings();


    server.sendHeader(
        "Location",
        "/"
    );

    server.send(
        303,
        "text/plain",
        "Saved"
    );
}


