lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
// ======================================================================
// RESTORE DEFAULTS
// ======================================================================

void handleDefaults() {

    noteWebActivity();


    setFactoryDefaults();

    saveSettings();


    lowSpeedProfile =
        false;


    batteryState =
        BATTERY_UNKNOWN;

    batteryFilterInitialized =
        false;


    server.sendHeader(
        "Location",
        "/"
    );

    server.send(
        303,
        "text/plain",
        "Defaults restored"
    );
}


// ======================================================================
// WI-FI OFF ROUTE
// ======================================================================

void handleWifiOff() {

    noteWebActivity();


    server.send(
        200,
        "text/html",
        R"HTML(
<html>

<body
style="
font-family:Arial;
background:#111;
color:white;
padding:30px;
">

<h2>GraveDig</h2>

<p>
Configuration Wi-Fi is shutting down.
</p>

<p>
The vehicle remains SAFE.
</p>

</body>

</html>
)HTML"
    );


    wifiShutdownRequested =
        true;

    wifiShutdownRequestTime =
        millis();
}


// ======================================================================
// WEB ROUTES
// ======================================================================

void configureWebRoutes() {

    static bool configured =
        false;


    if (configured) {
        return;
    }


    configured =
        true;


    server.on(
        "/",
        HTTP_GET,
        []() {

            noteWebActivity();

            server.send(
                200,
                "text/html",
                makeWebPage()
            );
        }
    );


    server.on(
        "/status",
        HTTP_GET,
        handleStatus
    );


    server.on(
        "/save",
        HTTP_POST,
        handleSave
    );


    server.on(
        "/defaults",
        HTTP_POST,
        handleDefaults
    );


    server.on(
        "/wifi-off",
        HTTP_POST,
        handleWifiOff
    );


    server.onNotFound(
        []() {

            noteWebActivity();

            server.send(
                404,
                "text/plain",
                "Not found"
            );
        }
    );
}


// ======================================================================
// START CONFIG WI-FI
// ======================================================================

void startConfigWiFi() {

    if (
        wifiConfigActive
    ) {
        return;
    }


    motorsArmed =
        false;

    stopMotorsImmediate();


    WiFi.mode(
        WIFI_AP
    );


    bool success =
        WiFi.softAP(
            AP_SSID,
            AP_PASSWORD
        );


    if (!success) {

        WiFi.mode(
            WIFI_OFF
        );

        Serial.println(
            "Wi-Fi AP start failed."
        );

        return;
    }


    configureWebRoutes();

    server.begin();


    wifiConfigActive =
        true;

    wifiShutdownRequested =
        false;

    wifiLastActivity =
        millis();


    Serial.println();
    Serial.println(
        "Configuration Wi-Fi ON"
    );

    Serial.print(
        "SSID: "
    );

    Serial.println(
        AP_SSID
    );

    Serial.print(
        "Address: "
    );

    Serial.println(
        WiFi.softAPIP()
    );


    queueRumble(
        2,
        120,
        100,
        60,
        60
    );
}


// ======================================================================
// STOP CONFIG WI-FI
// ======================================================================

void stopConfigWiFi() {

    if (
        !wifiConfigActive
    ) {
        return;
    }


    server.stop();


    WiFi.softAPdisconnect(
        true
    );

    WiFi.mode(
        WIFI_OFF
    );


    wifiConfigActive =
        false;

    wifiShutdownRequested =
        false;


    motorsArmed =
        false;

    stopMotorsImmediate();


    Serial.println(
        "Configuration Wi-Fi OFF"
    );


    queueRumble(
        1,
        160,
        0,
        50,
        50
    );
}


// ======================================================================
// SERVICE WEB SERVER
// ======================================================================

void serviceConfigWiFi() {

    if (
        !wifiConfigActive
    ) {
        return;
    }


    server.handleClient();


    if (
        wifiShutdownRequested
    ) {

        if (
            millis() -
            wifiShutdownRequestTime >
            500
        ) {

            stopConfigWiFi();
        }

        return;
    }


    unsigned long timeout =
        settings.wifiTimeoutSeconds *
        1000UL;


    if (
        millis() -
        wifiLastActivity >
        timeout
    ) {

        Serial.println(
            "Wi-Fi idle timeout."
        );

        stopConfigWiFi();
    }
}


// ======================================================================
// CHECK STICK CENTERING
// ======================================================================

bool sticksCentered() {

    if (!controller) {
        return false;
    }


    int margin =
        settings.stickDeadzone +
        30;


    return
        abs(
            controller->axisY()
        ) <
        margin
        &&
        abs(
            controller->axisRY()
        ) <
        margin;
}


// ======================================================================
// CONFIG ACCESS WINDOW
// ======================================================================

bool wifiAccessWindowOpen() {

    if (
        settings.wifiAccessWindowSeconds ==
        0
    ) {
        return true;
    }


    return
        millis() <=
        settings.wifiAccessWindowSeconds *
        1000UL;
}


// ======================================================================
// WI-FI BUTTON COMBINATION
// ======================================================================

void processWiFiCombo() {

    if (!controller) {

        wifiComboActive =
            false;

