lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
        wifiComboTriggered =
            false;

        wifiComboStart =
            0;

        return;
    }


    bool combo =
        controller->y() &&
        controller->miscStart();


    if (!combo) {

        wifiComboActive =
            false;

        wifiComboTriggered =
            false;

        wifiComboStart =
            0;

        return;
    }


    // Cannot ENTER config mode while armed.
    // We do allow the combo while Wi-Fi is already active
    // so that it can be turned off.

    if (
        !wifiConfigActive &&
        motorsArmed
    ) {

        wifiComboActive =
            false;

        return;
    }


    // Require centered sticks.

    if (
        !sticksCentered()
    ) {

        wifiComboActive =
            false;

        return;
    }


    // Startup access window only affects ENTRY,
    // never shutdown.

    if (
        !wifiConfigActive &&
        !wifiAccessWindowOpen()
    ) {

        if (
            !wifiComboTriggered
        ) {

            wifiComboTriggered =
                true;

            Serial.println(
                "Wi-Fi configuration access window closed."
            );


            queueRumble(
                2,
                100,
                80,
                40,
                40
            );
        }


        return;
    }


    if (
        !wifiComboActive
    ) {

        wifiComboActive =
            true;

        wifiComboTriggered =
            false;

        wifiComboStart =
            millis();
    }


    unsigned long required =
        settings.wifiHoldSeconds *
        1000UL;


    if (
        !wifiComboTriggered &&
        millis() -
        wifiComboStart >=
        required
    ) {

        wifiComboTriggered =
            true;


        if (
            wifiConfigActive
        ) {

            stopConfigWiFi();

        } else {

            startConfigWiFi();
        }
    }
}


// ======================================================================
// CONTROLLER CONNECTION
// ======================================================================

void onConnectedController(
    ControllerPtr ctl
) {

    if (
        controller != nullptr
    ) {

        return;
    }


    controller =
        ctl;


    motorsArmed =
        false;

    stopMotorsImmediate();


    lastControllerColor =
        0xFFFFFFFF;


    Serial.println();
    Serial.println(
        "DualSense connected."
    );


    queueRumble(
        1,
        150,
        0,
        60,
        40
    );


    // If battery was already low before
    // controller connected, notify now.

    if (
        settings.batteryEnabled &&
        batteryState ==
        BATTERY_LOW &&
        settings.batteryRumble
    ) {

        queueRumble(
            2,
            180,
            150,
            90,
            60
        );
    }


    if (
        settings.batteryEnabled &&
        batteryState ==
        BATTERY_CRITICAL &&
        settings.batteryRumble
    ) {

        queueRumble(
            3,
            230,
            120,
            180,
            150
        );
    }
}


// ======================================================================
// CONTROLLER DISCONNECT
// ======================================================================

void onDisconnectedController(
    ControllerPtr ctl
) {

    if (
        ctl !=
        controller
    ) {
        return;
    }


    controller =
        nullptr;


    motorsArmed =
        false;


    stopMotorsImmediate();


    wifiComboActive =
        false;

    wifiComboTriggered =
        false;


    rumblePattern.active =
        false;


    Serial.println(
        "DualSense disconnected - motors stopped."
    );
}


// ======================================================================
// BUTTON PROCESSING
// ======================================================================

void processButtons() {

    if (!controller) {
        return;
    }


    // Wi-Fi combo gets priority because it uses OPTIONS.
    processWiFiCombo();


    bool triangle =
        controller->y();


    // --------------------------------------------------------------
    // OPTIONS = Arm / Disarm
    //
    // Suppress normal OPTIONS action while Triangle is also held.
    // --------------------------------------------------------------

    bool options =
        controller->miscStart();


    if (
        options &&
        !previousOptions &&
        !triangle
    ) {

        if (
            !emergencyAbort &&
            !wifiConfigActive
        ) {

            bool canArm =
                true;


            if (
                settings.batteryEnabled &&
                batteryState ==
                    BATTERY_CRITICAL &&
                settings.criticalBehavior ==
                    2
            ) {

                canArm =
                    false;
            }


            if (
                !motorsArmed &&
                canArm
            ) {

                // Require sticks centered before arming.
                if (
                    sticksCentered()
                ) {

                    motorsArmed =
                        true;

                    stopMotorsImmediate();


                    queueRumble(
                        1,
                        120,
                        0,
                        60,
                        40
                    );

                } else {

                    queueRumble(
                        2,
                        80,
                        80,
                        30,
                        30
                    );
                }

            } else {

                motorsArmed =
                    false;

                stopMotorsImmediate();
            }
        }
    }


    previousOptions =
        options;


    // --------------------------------------------------------------
    // L1 = low profile
    // --------------------------------------------------------------

    bool l1 =
        controller->l1();


    if (
        l1 &&
        !previousL1
    ) {

