lanman1/ESP32-based-control-of-RC-car-using-PS5-controller/ESP32-RC-Tank-WebUI.ino
        lowSpeedProfile =
            true;
    }


    previousL1 =
        l1;


    // --------------------------------------------------------------
    // R1 = normal profile
    // --------------------------------------------------------------

    bool r1 =
        controller->r1();


    if (
        r1 &&
        !previousR1
    ) {

        lowSpeedProfile =
            false;
    }


    previousR1 =
        r1;
}


// ======================================================================
// SERIAL TELEMETRY
// ======================================================================

void printTelemetry() {

    if (
        millis() -
        lastSerialTelemetry <
        1000
    ) {
        return;
    }


    lastSerialTelemetry =
        millis();


    Serial.printf(
        "BT:%s ARM:%s WIFI:%s "
        "L:%d R:%d "
        "BAT:%.2f %s\n",

        (
            controller &&
            controller->isConnected()
        )
            ? "OK"
            : "WAIT",

        motorsArmed
            ? "YES"
            : "NO",

        wifiConfigActive
            ? "ON"
            : "OFF",

        leftMotorCommand,

        rightMotorCommand,

        batteryFilteredVoltage,

        batteryStateName(
            batteryState
        )
    );
}


// ======================================================================
// SETUP
// ======================================================================

void setup() {

    Serial.begin(
        115200
    );


    delay(
        500
    );


    Serial.println();
    Serial.println(
        "================================="
    );

    Serial.println(
        "GraveDig RC Tank"
    );

    Serial.print(
        "Firmware "
    );

    Serial.println(
        FIRMWARE_VERSION
    );

    Serial.println(
        "================================="
    );


    // Emergency input

    pinMode(
        ABORT_BUTTON,
        INPUT_PULLUP
    );


    // Settings

    loadSettings();


    // Pixels

    pixels.begin();

    pixels.setBrightness(
        settings.pixelBrightness
    );

    pixels.clear();

    pixels.show();


    // Motors

    setupPWM();

    stopMotorsImmediate();


    // Battery ADC

    analogReadResolution(
        12
    );

    analogSetPinAttenuation(
        BATTERY_ADC_PIN,
        ADC_11db
    );


    // Wi-Fi begins OFF

    WiFi.mode(
        WIFI_OFF
    );


    // Bluepad32

    BP32.setup(
        &onConnectedController,
        &onDisconnectedController
    );


    // IMPORTANT:
    //
    // Do NOT call:
    //
    // BP32.forgetBluetoothKeys();
    //
    // during normal boot.


    Serial.println();
    Serial.println(
        "Waiting for DualSense..."
    );

    Serial.println(
        "OPTIONS = Arm / Disarm"
    );

    Serial.println(
        "L1 = Low speed"
    );

    Serial.println(
        "R1 = Normal speed"
    );

    Serial.println(
        "OPTIONS + TRIANGLE = Configuration"
    );


    lastRampUpdate =
        millis();


    updateStatusIndicators();
}


// ======================================================================
// MAIN LOOP
// ======================================================================

void loop() {

    // --------------------------------------------------------------
    // Emergency safety
    // --------------------------------------------------------------

    checkAbortButton();


    // --------------------------------------------------------------
    // Bluepad32
    // --------------------------------------------------------------

    BP32.update();


    // --------------------------------------------------------------
    // Battery monitoring
    // --------------------------------------------------------------

    serviceBatteryMonitor();


    // --------------------------------------------------------------
    // Controller
    // --------------------------------------------------------------

    if (
        controller &&
        controller->isConnected() &&
        controller->isGamepad()
    ) {

        processButtons();

        processDrive();

    } else {

        requestedLeftMotor =
            0;

        requestedRightMotor =
            0;
    }


    // --------------------------------------------------------------
    // Motor output
    // --------------------------------------------------------------

    serviceMotorRamp();


    // --------------------------------------------------------------
    // Wi-Fi / web server
    // --------------------------------------------------------------

    serviceConfigWiFi();


    // --------------------------------------------------------------
    // Rumble patterns
    // --------------------------------------------------------------

    serviceRumble();


    // --------------------------------------------------------------
    // Status LEDs / controller lightbar
    // --------------------------------------------------------------

    updateStatusIndicators();


    // --------------------------------------------------------------
    // USB diagnostics
    // --------------------------------------------------------------

    printTelemetry();


    delay(
        3
    );
}